IdeaRS.OpenModel.CrossSection.CrossSectionType
Type of cross-section

IdeaRS.OpenModel.CrossSection.CrossSectionType.OneComponentCss
Cross-section with one component without shape specification

IdeaRS.OpenModel.CrossSection.CrossSectionType.RolledI
Rolled I

IdeaRS.OpenModel.CrossSection.CrossSectionType.RolledAngle
Rolled angle

IdeaRS.OpenModel.CrossSection.CrossSectionType.RolledT
Rolled T

IdeaRS.OpenModel.CrossSection.CrossSectionType.RolledU
Rolled Channel

IdeaRS.OpenModel.CrossSection.CrossSectionType.RolledCHS
Rolled circular holow section

IdeaRS.OpenModel.CrossSection.CrossSectionType.RolledRHS
Rolled rectangular hollow setion

IdeaRS.OpenModel.CrossSection.CrossSectionType.RolledDoubleUo
Composed double U rolled - ][

IdeaRS.OpenModel.CrossSection.CrossSectionType.RolledDoubleUc
Composed double U rolled - []

IdeaRS.OpenModel.CrossSection.CrossSectionType.RolledDoubleLt
Composed double L rolled - _||_

IdeaRS.OpenModel.CrossSection.CrossSectionType.RolledDoubleLu
Pair double L  |_ _|

IdeaRS.OpenModel.CrossSection.CrossSectionType.RolledTI
T profile made from part of I profile

IdeaRS.OpenModel.CrossSection.CrossSectionType.RolledIPar
Rolled IPar - Parametrized I section

IdeaRS.OpenModel.CrossSection.CrossSectionType.RolledUPar
Rolled UPar - Parametrized Channel section

IdeaRS.OpenModel.CrossSection.CrossSectionType.RolledLPar
Rolled LPar - Parametrized Angle section

IdeaRS.OpenModel.CrossSection.CrossSectionType.BoxFl
Welded Box - contains two dominante flanges and two webs
-----
| |
-----

IdeaRS.OpenModel.CrossSection.CrossSectionType.BoxWeb
Welded Box - contains two dominante flanges and two webs, bottom flange is inside between webs
------
|  |
|--|

IdeaRS.OpenModel.CrossSection.CrossSectionType.Box2I
Box from double I rolled - II

IdeaRS.OpenModel.CrossSection.CrossSectionType.Box2U
Box from double 2U

IdeaRS.OpenModel.CrossSection.CrossSectionType.Box2U2PI
Box from 2U and 2 Plates

IdeaRS.OpenModel.CrossSection.CrossSectionType.Box2L
Box welded from two rolled L-profiles

IdeaRS.OpenModel.CrossSection.CrossSectionType.Box4L
Box section welded from 4 L-profiles

IdeaRS.OpenModel.CrossSection.CrossSectionType.Iw
Welded I

IdeaRS.OpenModel.CrossSection.CrossSectionType.Iwn
Asymmetrical welded I

IdeaRS.OpenModel.CrossSection.CrossSectionType.Tw
Welded T

IdeaRS.OpenModel.CrossSection.CrossSectionType.O
Circular section

IdeaRS.OpenModel.CrossSection.CrossSectionType.Rect
Rectangular

IdeaRS.OpenModel.CrossSection.CrossSectionType.Ign
Massive asymetrical I

IdeaRS.OpenModel.CrossSection.CrossSectionType.Igh
Massive symetrical I with web root chamfering

IdeaRS.OpenModel.CrossSection.CrossSectionType.Tg
Massive T

IdeaRS.OpenModel.CrossSection.CrossSectionType.Lg
Massive L

IdeaRS.OpenModel.CrossSection.CrossSectionType.LgMirrored
Mirrored Massive L

IdeaRS.OpenModel.CrossSection.CrossSectionType.Ug
Massive U

IdeaRS.OpenModel.CrossSection.CrossSectionType.CHSg
Massive circular hollow section

IdeaRS.OpenModel.CrossSection.CrossSectionType.Zg
Massive Z section

IdeaRS.OpenModel.CrossSection.CrossSectionType.RHSg
Massive Rectangular hollow section

IdeaRS.OpenModel.CrossSection.CrossSectionType.Oval
Oval shape

IdeaRS.OpenModel.CrossSection.CrossSectionType.General
General cross-section

IdeaRS.OpenModel.CrossSection.CrossSectionType.Rolled2I
Pair rolled 2I

IdeaRS.OpenModel.CrossSection.CrossSectionType.Trapezoid
Trapezoid

IdeaRS.OpenModel.CrossSection.CrossSectionType.Ttfh
Massive T with top flange haunch

IdeaRS.OpenModel.CrossSection.CrossSectionType.Twh
Massive T with wall haunch

IdeaRS.OpenModel.CrossSection.CrossSectionType.Tgrev
Massive T reverse

IdeaRS.OpenModel.CrossSection.CrossSectionType.Ttfhrev
Massive T reverse with bottom flange haunch

IdeaRS.OpenModel.CrossSection.CrossSectionType.Twhrev
Massive T reverse with wall haunch

IdeaRS.OpenModel.CrossSection.CrossSectionType.Tchamfer1
Massive T chamfer 1

IdeaRS.OpenModel.CrossSection.CrossSectionType.Tchamfer2
Massive T chamfer 2

IdeaRS.OpenModel.CrossSection.CrossSectionType.TT
TT section

IdeaRS.OpenModel.CrossSection.CrossSectionType.TT1
TT chamfer section

IdeaRS.OpenModel.CrossSection.CrossSectionType.Sg
Massive S section

IdeaRS.OpenModel.CrossSection.CrossSectionType.GeneralSteel
General steel cross-section

IdeaRS.OpenModel.CrossSection.CrossSectionType.GeneralConcrete
General concrete cross-section

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamBox
Hollow cross-section with composite slab

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamBox1
Hollow cross-section with composite slab

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamIgenT
I-shaped cross-section with composite slab

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamLLeft
Composite beam cross-section - L left

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamPlate
Composite slab

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamRResT
Composite beam cross-section - R res T

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamRResT1
Composite beam cross-section - R res T - 1

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamRT
Composite beam cross-section - R T

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamShapeChamf
I-shaped cross-section with composite slab

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamShapeChamfAssym
Assymetrical I-shaped cross-section with composite slab

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamShapeIgen
I-shaped cross-section with composite slab

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamShapeIT
I-shaped cross-section with composite slab

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamShapeITAssym
Assymetrical I-shaped cross-section with composite slab

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamTLeft
Composite beam cross-section -  T left

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamTrapezoid
Trapezoidal cross-section with composite slab

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamTresT
T-shaped cross-section with composite slab

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamTrev
T-shaped cross-section with composite slab

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamTrevResI
Composite beam cross-section -  T rev res I

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamTrevResI1
Composite beam cross-section -  T rev res I - 1

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamTrevResR
Composite beam cross-section -  T rev res R

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamTrevResR1
Composite beam cross-section -  T rev res R - 1

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamTrevT
Composite beam cross-section -  T rev T

IdeaRS.OpenModel.CrossSection.CrossSectionType.CompositeBeamShapeTT
Composite beam cross-section -  TT

IdeaRS.OpenModel.CrossSection.CrossSectionType.BeamShapeIHaunchChamfer
Beam cross-section -  I haunch chamfer

IdeaRS.OpenModel.CrossSection.CrossSectionType.BeamShapeIHaunchChamferAssym
Beam cross-section -  I haunch chamfer assymetric

IdeaRS.OpenModel.CrossSection.CrossSectionType.BeamShapeRevU
Beam cross-section -  Rev U

IdeaRS.OpenModel.CrossSection.CrossSectionType.BeamShapeBox
Beam cross-section -  Box

IdeaRS.OpenModel.CrossSection.CrossSectionType.BeamShapeBox1
Beam cross-section -  Box - 1

IdeaRS.OpenModel.CrossSection.CrossSectionType.BeamShapeTrevChamferHaunchS
Beam cross-section -  T rev Chamfer Haunch S

IdeaRS.OpenModel.CrossSection.CrossSectionType.BeamShapeTrevChamferHaunchD
Beam cross-section -  T rev Chamfer Haunch D

IdeaRS.OpenModel.CrossSection.CrossSectionType.BeamShapeIrevDegen
Beam cross-section -  I rev Degen

IdeaRS.OpenModel.CrossSection.CrossSectionType.BeamShapeIrevDegenAdd
Beam cross-section -  I rev Degen Add

IdeaRS.OpenModel.CrossSection.CrossSectionType.BeamShapeTrevDegen
Beam cross-section -  T rev Degen

IdeaRS.OpenModel.CrossSection.CrossSectionType.BeamShapeTrevDegenAdd
Beam cross-section -  T rev Degen Add

IdeaRS.OpenModel.CrossSection.CrossSectionType.BeamShapeZDegen
Beam cross-section -  Z Degen

IdeaRS.OpenModel.CrossSection.CrossSectionType.BeamShapeIZDegen
Beam cross-section -  IZ Degen

IdeaRS.OpenModel.CrossSection.CrossSectionType.BeamShapeLDegen
Beam cross-section -  L Degen

IdeaRS.OpenModel.CrossSection.CrossSectionType.CHSPar
Parametric circular hollow section

IdeaRS.OpenModel.CrossSection.CrossSectionType.UniqueName
Unique Name